{
  "task_id": "task_0",
  "query": "Search for recent stock price of Hims",
  "url_sources": [
    "https://www.marketwatch.com/investing/stock/hims"
  ],
  "removed_matches": [
    {
      "pattern": "(?i)contact us.*",
      "matched": "Contact Us"
    },
    {
      "pattern": "(?i)terms.*",
      "matched": "Terms of Use | Privacy Notice | Cookie Notice ()."
    },
    {
      "pattern": "(?i)terms.*",
      "matched": "terms of use. Historical and current end-of-day data provided by FACTSET. All quotes are in local exchange time. Real-time last sale data for U.S. stock quotes reflect trades reported through Nasdaq only. Intraday data delayed at least 15 minutes or per exchange requirements."
    },
    {
      "pattern": "(?i)all rights reserved.*",
      "matched": "All rights reserved."
    },
    {
      "pattern": "(?i)back to top.*",
      "matched": "Back to Top"
    },
    {
      "pattern": "(?i)login.*",
      "matched": "Login"
    },
    {
      "pattern": "(?i)sign up.*",
      "matched": "Sign Up"
    },
    {
      "pattern": "(?i)sign up.*",
      "matched": "sign up to get started."
    }
  ],
  "cleaned_content_preview": "Stock Quote (U.S.: NYSE) | MarketWatch ![Image 2]( Skip to main content Main Menu Subscribe Now Latest News Watchlist Investing Back Investing World Markets Back Investing World Markets United States Canada Europe & Middle East Asia Latin America Emerging Markets Financial Markets Back Investing Financial Markets Bonds Commodities Cryptocurrencies Currencies ETFs Futures IPOs Mutual Funds Options Stocks Industries Back Investing Industries Automotive Banking Internet & Online Services Retail Software Technology Featured How to Invest Best New Ideas in Money Financial Adviser Center Newswires Tools Market Data Center Personal Finance Back Personal Finance Retirement Real Estate Credit Cards Spending & Saving TaxWatch Careers The Moneyist Real Estate Listings Travel Economy Back Economy Inflation The Federal Reserve Washington Watch Economic Report U.S. Economic Calendar Market Data & Tools Back Market Data & Tools Watchlist Stock Screener Market Screener Multiple Quotes Tool Fund Comparison Mutual Fund Screener Earnings Calendar U.S. Economic Calendar IPO Calendar Options Expiration Calendar Mortgage Calculator Where Should I Retire U.S. Market Movers Trending Tickers by Volume Premarket Movers After Hours Movers Top 25 Mutual Funds Top 25 ETFs Most Shorted Stocks Analyst Upgrades & Downgrades Featured Financial Literacy Month Commerce MarketWatch Picks Back MarketWatch Picks Banking Lifestyle Loans Money Real Estate Retirement MarketWatch Guides Back MarketWatch Guides Busine..."
}