{
  "task_id": "task_1",
  "query": "Research case studies of specific tariffs and their impact on various industries",
  "url_sources": [
    "https://www.richmondfed.org/publications/research/economic_brief/2025/eb_25-12"
  ],
  "removed_matches": [
    {
      "pattern": "(?i)stay connected.*",
      "matched": "Stay Connected"
    },
    {
      "pattern": "(?i)subscribe to email alerts.*",
      "matched": "Subscribe to Email Alerts"
    },
    {
      "pattern": "(?i)receive email alerts.*",
      "matched": "Receive email alerts for speeches, press releases, and news."
    },
    {
      "pattern": "(?i)email address.*",
      "matched": "Email Address"
    },
    {
      "pattern": "(?i)email address.*",
      "matched": "Email Address "
    },
    {
      "pattern": "(?i)email address.*",
      "matched": "Email Address "
    },
    {
      "pattern": "(?i)email subscriptions.*",
      "matched": "Email Subscriptions"
    },
    {
      "pattern": "(?i)unsubscribe.*",
      "matched": "unsubscribe at any time using the Unsubscribe link at the bottom of every email."
    },
    {
      "pattern": "(?i)contact us.*",
      "matched": "Contact Us"
    },
    {
      "pattern": "(?i)contact us.*",
      "matched": "Contact Us"
    },
    {
      "pattern": "(?i)feedback.*",
      "matched": "Feedback"
    },
    {
      "pattern": "(?i)faqs.*",
      "matched": "FAQs"
    },
    {
      "pattern": "(?i)terms & conditions.*",
      "matched": "Terms & Conditions and Privacy Notice."
    },
    {
      "pattern": "(?i)terms & conditions.*",
      "matched": "Terms & Conditions"
    },
    {
      "pattern": "(?i)privacy policy.*",
      "matched": "privacy policy "
    }
  ],
  "cleaned_content_preview": "Published Time: 2025-04-02T10:00:00Z Tariffs: Estimating the Economic Impact of the 2025 Measures and Proposals | Richmond Fed Skip to Main Content Menu Enter search term Search About Us We’re one of 12 regional Federal Reserve Banks working together with the Board of Governors to support a healthy economy. Our job is to serve the American public — to serve you. And our mission is to foster economic stability and strength. Learn more about our bank > Who We Are & What We Do Our Work in Our Communities Doing Business with the Bank Our Leadership Our Governance Connect with Us Request a Speaker Holiday Schedule Banking & Supervision We work to support a safe and sound financial system and foster an efficient and accessible payments system. Financial Services Banking Supervision Banker Resources Banking Research & Data Consumer Resources Contacts Economic Research We conduct research to support policymaking and thought leadership on issues important to the Federal Reserve and the Fifth District. We also inform the public through our data and economic analysis, publications, presentations and educational resources. Learn more about Economic Research > Data & Analysis Publications Blog Podcast Events CORE Week District Dialogues Contacts Our Team Region & Communities We share research, data and resources and regularly engage regional leaders and policymakers to understand and address community‐specific economic issues. Small Town & Rural Initiative Regional Data & Analysis Communi..."
}